# set arguments for all 'brew cask install' commands
cask_args appdir: '~/Applications'

# 'brew install', always 'brew services restart', 'brew link', 'brew unlink mysql' (if it is installed)
# Don't need MySQL right now brew 'mysql@5.6', restart_service: true, link: true, conflicts_with: ['mysql']
brew 'git'
brew 'wget'
brew 'cloc'
brew 'dos2unix'
brew 'jq'
brew 'neovim'
brew 'ripgrep'
brew 'fd'
brew 'nmap'
brew 'node'
brew 'rbenv'
brew 'ruby-build'
brew 'the_silver_searcher'
brew 'sqlite'
brew 'svn'
brew 'bat'

# Modern CLI tools
brew 'fzf'        # Fuzzy finder for files, history, everything
brew 'eza'        # Modern ls replacement with icons and git status
brew 'zoxide'     # Smart cd with frecency
brew 'starship'   # Fast, customizable prompt
brew 'delta'      # Better git diffs with syntax highlighting
brew 'direnv'     # Auto-load .envrc per project
brew 'sheldon'    # Fast, configurable shell plugin manager

# Development tools
brew 'cmake'
brew 'python'
brew 'go'
brew 'java'

cask 'google-chrome'
cask 'firefox'
cask 'slack'
cask 'bettertouchtool'
# Uncomment this line if you are installing this from regular Terminal
# cask 'iterm2'
