# 'brew tap'
tap "homebrew/cask"
# set arguments for all 'brew cask install' commands
cask_args appdir: "~/Applications"

# 'brew install', always 'brew services restart', 'brew link', 'brew unlink mysql' (if it is installed)
brew "mysql@5.6", restart_service: true, link: true, conflicts_with: ["mysql"]
brew 'git'
brew 'wget'
brew 'cloc'
brew 'dos2unix'
brew 'jq'
brew 'macvim'
brew 'nmap'
brew 'node'
brew 'rbenv'
brew 'the_silver_searcher'
brew 'sqlite
brew 'svn'
brew 'homebrew/cask-fonts/font-roboto-mono-for-powerline'

cask "google-chrome"
cask "firefox"
cask 'slack'
cask 'spotify'
cask 'evernote'
cask '1password'
cask 'bettertouchtool'
cask 'iterm2'
