# 'brew tap'
tap 'homebrew/cask'
# set arguments for all 'brew cask install' commands
cask_args appdir: '~/Applications'

# 'brew install', always 'brew services restart', 'brew link', 'brew unlink mysql' (if it is installed)
# Don't need MySQL right now brew 'mysql@5.6', restart_service: true, link: true, conflicts_with: ['mysql']
brew 'git'
brew 'wget'
brew 'cloc'
brew 'dos2unix'
brew 'jq'
brew 'macvim'
brew 'nmap'
brew 'node'
brew 'rbenv'
brew 'the_silver_searcher'
brew 'sqlite'
brew 'svn'
# These next ones are necessary to make YouCompleteMe work
brew 'cmake'
brew 'python'
brew 'go'
brew 'nodejs'
brew 'java'
brew 'llvm'

cask 'google-chrome'
cask 'firefox'
cask 'slack'
cask 'evernote'
cask 'bettertouchtool'
cask 'iterm2'
